Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Tom got off at the wrong station.
hi: टॉम गलत स्थानक पर उतर गया।

source: Tom finally ate something.
hi: टॉम ने आखिरकार कुछ खाया।

source: Tom eats the same food every day.
hi: टॉम वही खाना हर रोज़ खाता है।

source: Tom doesn't want to read that book.
hi: टॉम को वह किताब पढ़नी नहीं है।

source: Tom doesn't like dogs.
hi: टॉम को कुत्ते पसंद नहीं।

source: Tom doesn't know who I am.
hi: टॉम नहीं जानता मैं कौन हूं।

source: Tom doesn't have tea.
hi: टॉम के पास चाय नहीं है।

source: Tom doesn't eat meat.
hi: टॉम गोश्त नहीं खाता है।

source: Tom doesn't do things like that.
hi: टॉम वैसी चीज़ें नहीं करता।

source: Tom didn't read the newspaper yesterday.
hi: टॉम ने कल अखबार नहीं पढ़ा।

source: Tom didn't know whether to laugh or cry.
hi: टॉम को सूझ नहीं रहा था के वह हँसे या रोये.

source: Tom can't swim.
hi: टॉम तैर नहीं सकता।

source: Tom can't swim tomorrow.
hi: टॉम कल तैर नहीं सकता।

source: Tom can't swim at all.
hi: टॉम बिलकुल भी तैर नहीं सकता।

source: Tom can't seem to do anything right.
hi: टॉम कुछ भी सही ढंग से नहीं कर सकता.

source: Tom can't read French.
hi: टॉम को फ़्रांसीसी पढ़ने नहीं आती।

source: Tom can't read all these books in one day.
hi: टॉम यह सारी किताबें एक दिन में नहीं पढ़ सकता।

source: Tom can't play the piccolo.
hi: टॉम पिकोलो नहीं बजा सकता।

source: Tom can't play tennis here.
hi: टॉम यहाँ टेनिस नहीं खेल सकता।

source: Tom can't find his bag.
hi: टॉम को उसकी बॅग नहीं मिल रही।

source: Tom can swim.
hi: टॉम तैर सकता है।

source: Tom came a little after noon.
hi: टॉम दोपहर के बाद थोडी ही देर में आया।

source: Tom bought a sweater for thirty dollars.
hi: टॉम ने तीस डौलर्स में स्वेटर खरीदा।

source: Tom always looks happy.
hi: टॉम हमेशा ख़ुश लगता है।

source: I hear that Tom isn't in Boston now.
hi: सुना है टॉम अब बॉस्टन में नहीं है।

source: Tom's dream is to travel around the world with Mary.
hi: टॉम का सपना है मेरी के साथ पूरी दुनिया की सैर करना।

source: Tom told Mary that she was wrong.
hi: टॉम ने मैरी को बताया कि वह ग़लत थी|

source: Tom slapped Mary.
hi: टॉम ने मैरी को थप्पड़ मारी।

source: Tom pushed Mary out the door.
hi: टॉम ने मैरी को दरवाज़े के बाहर ढकेल दिया।

source: Tom often plays tennis with Mary after school.
hi: पाठशाला छूटने के बाद टॉम अक्सर मॅरी के साथ टेनिस खेलता है।

source: Tom left the matter entirely in Mary's hands.
hi: टॉमने मामला पूरी तरह मैरी के होथों सौंपा।

source: Tom is Mary's grandson.
hi: टॉम मैरी का पोता है।

source: Tom is married to Mary.
hi: टॉम की मैरी से शादी हुई है।

source: Tom couldn't understand what Mary was saying.
hi: टॉम मेरी की बात समझ नहीं पाया।

source: Tom couldn't get Mary to do it.
hi: टॉम मेरी को यह करने के लिए मनवा नहीं सका.

source: Tom answered all of Mary's questions.
hi: टॉम ने मैरी के सभी सवालों के जवाब दिए।

source: Mary used to play with dolls.
hi: मैरी गुड़ियों के साथ खेलती थी।

source: Zulfiqar was the famous sword of Hazret-i Ali, fourth caliph of Islam.
hi: ज़ुलफ़िकर इस्लाम के चौथे खलीफ़ा, हज़रती अली की मशहूर तलवार थी।

source: I was with him in January.
hi: जनवरी में मैं उसके साथ था।

source: Enter!
hi: आओ!

source: Tom stripped off his dirty clothes and threw them into the washing machine.
hi: टॉम ने अपने गंदे कपड़े उतार दिये और उन्हें वॉशिंग मशीन में डाल दिया।

source: Jews fled the Spanish Inquisition and took shelter in Ottoman Empire in the fifteenth century.
hi: पंद्रहवीं शताब्दी में स्पेनी धर्माधिकरण से पलायन कर रहे यहूदियों ने उस्मानी साम्राज्य में आश्रय लिया।

source: She reads the newspaper every morning.
hi: वह हर सुबह अखबार पढ़ती है।

source: I like Occitan.
hi: मुझे ऑक्सिटन पसंद है।

source: Stop it!
hi: बस करो!

source: We started at the same time.
hi: हमने एक ही वक्त शुरुआत की।

source: We wrote many books about China.
hi: हमने चीन के बारे में कई किताबें लिखी।

source: My grandfather was murdered during the Second World War.
hi: दूसरे विश्वयुद्ध के दौरान मेरे दादा का खून हुआ था।

source: Iran's and North Korea nuclear capabilities worry the rest of the world.
hi: ईरान और उत्तर कोरिया के परमाणु क्षमताओं से पूरी दुनिया परेशान है।

source: Have you met Masao, my brother?
hi: क्या तुम मेरे भाई मासाओ से मिली हो?

source: I was in China last year.
hi: पिछले साल में चीन में था।

source: I'm not a Nazi!
hi: मैं नाज़ी नहीं हूँ!

source: I didn't want to spend any more time in jail.
hi: मैं जेल में और वक्त नहीं बिताना चाहता था।

source: Who are you going to eat dinner with?
hi: डिनर किसके साथ करोगे?

source: Would you like to live in Mumbai?
hi: क्या आप मुम्बई में रहना पसंद करेंगे?

source: Careful!
hi: संभाल के!

source: This tea is good.
hi: यह वाली चाय अच्छी है।

source: It's nine-thirty.
hi: साडे नौ।

source: Wild!
hi: जंगली!

source: Don't ask her any questions about her marriage.
hi: उसकी शादी के बारे में उससे कोई सवाल मत पूछना।

source: Goodnight!
hi: शुभ रात्री!

source: I made tea last night.
hi: कल रात मैंने चाय बनाई।

source: That's a table.
hi: वह मेज़ है।

source: Life is an illusion.
hi: जीवन एक भ्रम है।

source: Bert's bisexuality was troubling Tom and excited Mary.
hi: बर्ट के उभयलैंगिकता से टॉम परेशान था और मैरी उत्तेजित।

source: My mother was crying.
hi: मेरी माँ रो रही थी।

source: I have an older brother who lives in Kyoto.
hi: मेरा एक बड़ा भाई है जो क्योटो में रहता है।

source: The thief admitted his crime.
hi: चोर ने अपना जुर्म कबूल किया।

source: There are many flowers in the garden.
hi: बगीचे में बहुत सारे फूल हैं।

source: Damn.
hi: इसकी तो.

source: Give me my sword.
hi: मुझे मेरी तलवार दे दो।

source: They are Russian.
hi: वे रूसी हैं।

source: It looks familiar.
hi: जाना-पहचाना लगता है।

source: I can't drink milk.
hi: मैं दूध नहीं पी सकता।

source: I was born in Russia.
hi: मैं रूस में जन्मा था।

source: Rafaela is an Italian name.
hi: राफ़ाएला इतालवी नाम है।

source: Natasha is a Russian name.
hi: नताशा रूसी नाम है।

source: Teresa is a Portuguese name.
hi: टेरेसा पुर्त्तगाली नाम है।

source: You should talk to Tom.
hi: तुम्हें टॉम से बात करनी चाहिए।

source: Tom took off his hat.
hi: टॉम ने अपनी टोपी उतारी।

source: Tom must be proud of himself.
hi: टॉम को खुद पर गर्व होगा।

source: Tom has a sister named Mary.
hi: टॉम की मॅरी नाम की एक बहन है।

source: Tom got the job he wanted.
hi: टॉम को मनचाही नौकरी मिल गई।

source: Tom felt uneasy talking to Mary about that matter.
hi: मैरी से उस मामले की बात करने में टॉम को बेचैनी महसूस हुई।

source: Tom doesn't understand any French.
hi: टॉम को फ्रांसीसी भाषा समझ नहीं आती।

source: Tom didn't want to marry Mary.
hi: टॉम मैरी से शादी करना नहीं चाहता था।

source: Tom didn't mean any harm.
hi: टॉम कोई नुकसान नहीं पहुँचाना चाहता था।

source: Tom certainly is skinny.
hi: टॉम तो बिलकुल पतला है।

source: Tom can't get over Mary.
hi: टॉम मेरी को दिल से निकाल नहीं सकता.

source: Tom beat Mary unconscious.
hi: टॉम ने मेरी को मार-मार कर बेहोश कर दिया।

source: My name is John.
hi: मेरा नाम जॉन है।

source: I had sex with a Soviet-American woman.
hi: मैं ने एक सोवियत-अमरीकी औरत के साथ सेक्स किया।

source: Those students are Korean.
hi: वे विद्यार्थी कोरियाई हैं।

source: Chen is a teacher.
hi: चेन एक अध्यापक है

source: I like China.
hi: मुझे चीन पसंद है।

source: Do you like tea?
hi: क्या आपको चाय अच्छी लगती है?

source: He likes tea.
hi: उसे चाय पसंद है।

source: Do you like this book?
hi: क्या तुम्हें यह किताब पसंद है ?

source: I don't like tea.
hi: मुझे चाय अच्छी नहीं लगती।

source: I will eat.
hi: मैं खाऊंगा।

source: Bring tea.
hi: चाय ला।

source: Give this to Ramu.
hi: यह रामू को दे देना।

source: Bring tea immediately!
hi: अभी के अभी चाय लाओ!

source: Ah! How serene is this temple!
hi: आह! ये मंदिर कितना शांत है I

source: Oh! Raju has fallen down the stairs!
hi: अरेरें! राजु सिढ़ियों से गिर गया क्या?

source: You'll be fine!
hi: तुम्हें कुछ नहीं होगा!

source: Where is the train?
hi: ट्रेन कहाँ है?

source: What's wrong with being nude in your own house?
hi: अपने ही घर में नंगा होने में क्या गलत है?

source: Tom was in New York at the time.
hi: उस समय टॉम न्यूयॉर्क में था।

source: Sorry!
hi: माफ़ करें!

source: The cat is black.
hi: बिल्ली काली है।

source: Tom seems to enjoy watching horror movies.
hi: लगता है टॉम को हॉरर फ़िल्में देखने में मज़ा आता है।

source: How many people died?
hi: कितने लोग मरें?

source: Dumbass!
hi: बुद्धू!

source: Why do you want to die?
hi: तुम मरना क्यों चाहते हो?

source: Gangway!
hi: गलियारा!

source: She betrayed you.
hi: उसने तुम्हें धोखा दिया।

source: Scram!
hi: धत!

source: You know English?
hi: तुम्हें अंग्रेंज़ी आती है?

source: I eat.
hi: मैं खाता हूँ।

source: I want to have sex with him.
hi: मैं उसके साथ सेक्स करना चाहता हूँ।

source: I want to have sex with her.
hi: मैं उसके साथ सेक्स करना चाहता हूँ।

source: The sun is in the sky.
hi: सूरज आकाश में है।

source: Who changed the subject?
hi: विषय किसने बदला?

source: All apples are red.
hi: सभी सेब लाल होते हैं।

source: Me too.
hi: मैं भी।

source: Cut the crap!
hi: बकवास बंद कर!

source: Cut the bullshit!
hi: बकवास बंद कर!

source: I hate this girl.
hi: मुझे इस लड़की से नफ़रत है।

source: The article was written in Russian.
hi: लेख रूसी में लिखा हुआ था।

source: The medicine only works on men.
hi: यह दवाई केवल पुरुषों पर काम करती है।

source: A river flows.
hi: नदी बहती है।

source: You're under arrest.
hi: तुम्हें गिरफ्तार किया जाता है।

source: Hail!
hi: स्तुति करो!

source: I'm drowning!
hi: मैं डूब रहा हूँ!

source: Farewell!
hi: विदाई!

source: Greetings!
hi: शुभकामानाएँ!

source: The girl is drinking tea.
hi: लड़की चाय पी रही है।

source: Gold is the king of kings.
hi: सोना तो राजाओं का राजा है।

source: The three major monotheistic religions are Christianity, Islam and Judaism.
hi: ईसाई धर्म, इस्लाम और यहुदी धर्म ये तीन प्रमुख एकेश्वरवादी धर्म हैं।

source: I wish I had this problem.
hi: काश ये समस्या मुझे हुई होती।

source: There are many cockroaches in the kitchen.
hi: रसोई में कई सारे तिलचट्टे हैं।

source: I still remember his name.
hi: मुझे अभी भी उसका नाम याद है।

source: Where did you go?
hi: तुम कहाँ गए थे?

source: Does this mean that we have to file bankruptcy?
hi: क्या इसका मतलब हमारा दिवाला निकल गया?

source: Tom went back to his office.
hi: टॉम अपने दफ़्तर लौटा।

source: Tom wants to be your friend.
hi: टॉम तुम्हारा दोस्त बनना चाहता है।

source: Tom wants to ask Mary something.
hi: टॉम मैरी से कुछ पूछना चाहता है।

source: Tom wants this one.
hi: टॉम को यह वाला चाहिए।

source: I eat a banana.
hi: मैं केला खाता हूँ।

source: Japan is here!
hi: जापान यहाँ है!

source: The sun is above me.
hi: सूरज मेरे ऊपर है।

source: The land is beneath me.
hi: ज़मीन मेरे नीचे है।

source: Bad things are behind me.
hi: बुरी चीज़ें मेरे पीछे हैं।

source: Good.
hi: अच्छा.

source: Men are going.
hi: आदमी जा रहे हैं।

source: The king and queen are coming.
hi: राजा-रानी आ रहे हैं।

source: You are watching.
hi: तुम देख रहे हो।

source: He is falling.
hi: वह गिर रहा है।

source: They are going.
hi: वे जा रहे हैं।

source: They are watching.
hi: वे देख रहे हैं।

source: You are coming.
hi: तुम आ रहे हो।

source: The two of you are watching.
hi: तुम दोनों देख रहे हो।

source: With whom are you eating?
hi: तुम किसके साथ खा रहे हो?

source: The pair of them is coming.
hi: वे दोनों आ रहे हैं।

source: I'm falling.
hi: मैं गिर रहा हूँ।

source: We are watching.
hi: हम देख रहे हैं।

source: You see me.
hi: तुम मुझे देखते हो।

source: I want it.
hi: मुझे चाहिए।

source: Go!
hi: जा!

source: Yes!
hi: जी!

source: Hurray!
hi: वाह!

source: Your hair shines like gold.
hi: तुम्हारे बाल सोने की तरह चमकते हैं।

source: Take off your clothes and lie down on the bed!
hi: अपने कपड़े उतार कर बिस्तर पर लेट जा!

source: I play a game with my sister.
hi: मैं मेरी बहन के साथ एक खेल खेलता हूँ।

source: An apple tree provides an apple.
hi: सेब के पेड़ से सेब प्राप्त होता है।

source: An orange tree provides an orange.
hi: संतरे के पेड़ से संतरा प्राप्त होता है।

source: The kid is drinking the milk.
hi: बच्चा दूध पीता है।

source: Can you sing the song?
hi: क्या तुम वह गाना गा सकते हो?

source: Read!
hi: पढ़ो!

source: He is not scared of snakes at all.
hi: वह सापोंं से बिलकुल भी नहीं डरता।

source: The American flag has fifty stars.
hi: अमरीकी झंडे में पचास सितारे हैं।

source: It is my dog.
hi: मेरा कुत्ता है।

source: We don't know it.
hi: हमें नहीं पता।

source: She is Japanese.
hi: वह जापानी है।

source: How many apples are there?
hi: कितने सेब हैं?

source: Tom put the children to bed.
hi: टॉम ने बच्चों को सुलाया।

source: Tom put a bandage on Mary's arm.
hi: टॉम ने मैरी के बांह पर पट्टी बांधी।

source: Tom never wears red.
hi: टॉम कभी भी लाल कपड़े नहीं पहनता।

source: Tom is our guest.
hi: टॉम हमारा मेहमान है।

source: I think Tom is going to win.
hi: मुझे लगता है टॉम जीतने वाला है।

source: Fine!
hi: ठीक!

source: Roger!
hi: संदेश पुष्टि!

source: I'm playing SpaceChem.
hi: मैं स्पेसकेम खेल रहा हूँ।

source: What's happening now in Poland?
hi: अभी पोलैंड में क्या हो रहा है?

source: You raped him!
hi: तुम ने उसका बलात्कार किया!

source: Password?
hi: पासवर्ड?

source: My name is Tom.
hi: मेरा नाम टॉम है।

source: I can run.
hi: मैं दौड़ सकता हूँ।

source: The woman said the spot was hers.
hi: औरत ने कहा वह जगह उसकी है.

source: Tom has lost control.
hi: टॉम ने नियंत्रण खो दिया था।

source: Know yourself.
hi: अपने आप को जानो।

source: We went to Russia.
hi: हम रूस गए।

source: Hurry!
hi: जल्दी करो!

source: There is a monster under my bed.
hi: मेरे बिस्तर के नीचे भूत है.

source: We're in Calgary!
hi: हम कॅलगरी में हैं!

source: I'm completely naked.
hi: मैं पूरी तरह से नंगा हूँ।

source: Mexico is a country in North America.
hi: मेक्सिको उत्तर अमेरिका में स्थित एक देश है।

source: Mexico is a country located in North America.
hi: मेक्सिको उत्तर अमरीका में स्थित एक देश है।

source: God, hear my prayer.
hi: हे ईश्वर, मेरी प्रार्थना सुनो।

source: This is my father's house.
hi: मेरे पापा का घर है।

source: It's like an elephant.
hi: हाथी जैसा है।

source: She didn't give an answer to every question.
hi: उसने हर एक सवाल का जवाब नहीं दिया।

source: I am trying to memorise the names of constellations.
hi: मैं सभी नक्षत्रों के नाम याद रखने की कोशिश कर रहा हूं।

source: I've lived in China for six months.
hi: मैं चीन में छह महीने रहा हूँ।

source: What do you think of Japan's economy?
hi: जापान की अर्थव्यवस्था के बारे में आपके क्या विचार हैं?

source: In Christianity, Jesus is believed to be the son of God.
hi: ईसाई धर्म में यीशु को ईश्वर का बेटा माना जाता है।

source: The age of the universe is about 13.75 billion years.
hi: ब्रह्मांड की आयु लगभग १३.७५ अरब साल हैं।

source: Unity in diversity.
hi: विविधता में एकता।

source: What were your favourite subjects at school?
hi: स्कूल में तुम्हारे पसंदीदा विषय कौनसे हैं?

source: Someone called Mr Dell is waiting for you in your office, Mrs Stevens.
hi: श्री स्टीवन्स, आपके दफ़्तर में श्री डेल नाम के कोई व्यक्ती आपकी प्रतिक्षा कर रहे हैं।

source: The three main monotheistic religions are Islam, Judaism and Christianity.
hi: इस्लाम, यहुदी धर्म और ईसाईयत यह तीन मुख्य एकेश्वरवादी धर्म हैं।

source: Have you seen it?
hi: क्या तुमने उसे देखा है?

source: Your journey starts here.
hi: तुम्हारा सफ़र यहीं शुरू होता है।

source: Where in Mexico are you guys going?
hi: मेक्सिको में तुम लोग कहाँ जा रहे हो?

source: Participate!
hi: हिस्सा लो!

source: Capri is one the most beautiful islands of Italy.
hi: कापरी इटली के सबसे सुंदर द्वीपों में से एक है।

source: I'll give him the letter.
hi: मैं उसे चिट्ठी दे दूंगा।

source: We are seven billion now.
hi: अभी हम सात अरब हैं।

source: The sixth prime minister of Malaysia is Dato' Sri Najib Abdul Razak.
hi: दातो श्री नाजिब अब्दुल रज़ाक मलेशिया के छठे प्रधान मंत्री है।

source: His father is a physicist.
hi: उसके पिता भौतिक विज्ञानी हैं।

source: The prime minister will make an announcement tomorrow.
hi: प्रधान मंत्री कल एक घोषणा करेंगे।

source: She could not understand the whole story.
hi: वह पूरी कहानी को नहीं समझ पायी ।

source: Are you able to read the book attentively?
hi: कया तुम ध्यान से किताब पाढ़ सकते हो ?

source: The film should have already started.
hi: फ़िल्म शुरू हो चुकी होगी।

source: That food is so bad that I wouldn't dream of eating it.
hi: वह खाना ऐसा बुरा है कि मैं उसको भूलकर भी नहीं खाना चाहती हूँ।

source: Don't break my heart.
hi: मेरा दिल मत तोड़ो।

source: Paulina has a pink cap.
hi: पॉलिना के पास गुलाबी टोपी है।

source: Ammonium carbonate is an organic compound.
hi: अमोनियम कार्बोनेट एक कार्बनिक यौगिक यौगिक है।

source: Right!
hi: सही!

source: How many languages are there in Europe?
hi: युरोप में कितनी भाषाएँ हैं?

source: Let's eat first.
hi: पहले खा लेते है।

source: Everyone needs to find his own path.
hi: सभी को अपना-अपना मार्ग ढूँढ़ना पड़ता है।

source: Turkey is the heir of Ottoman Empire.
hi: तुर्की उस्मानी साम्राज्य का वारिस है।

source: Leave!
hi: जाओ!

source: I'm in India.
hi: मैं भारत में हूँ।

source: I am in India.
hi: मैं भारत में हूँ।

source: The Umayyad armies invaded Spain in 711.
hi: उमय्यद सेनाओं ने ७११ में स्पेन पर आक्रमण किया।

source: Air is missing!
hi: वायु अनुपस्थित है!

source: Jenny has a gun.
hi: जेनी के पास एक बंदूक है।

source: In the land of the blind, the one-eyed man is king.
hi: अंधों में काना राजा।

source: We eat so we may live.
hi: हम इसलिए खाते हैं ताके हम जीवित रह सकें.

source: He took the guitar and started playing.
hi: उसने गिटार ले कर बजाना शुरू कर दिया।

source: Learn to speak English in little time!
hi: थोड़े ही समय में अंग्रेजी बोलना सीखें!

source: What time does the exam start?
hi: परीक्षा कितने बजे शुरू होगी?

source: Do you like New York?
hi: तुम्हें न्यू यॉर्क पसंद आया?

source: I'm an old man.
hi: मैं बूढ़ा हूँ।

source: There's nothing left to lose.
hi: गंवाने के लिए कुछ बचा नहीं है।

source: How many Chinese friends do you have?
hi: आपके कितने चीनी मित्र हैं?

source: Don't ask me why but, he ran away when he saw me.
hi: मुझे यह मत पूछना क्यूँ, किन्तु वह मुझे देख कर भाग गया.

source: Berlin is the capital of Germany.
hi: बर्लिन जर्मनी की राजधानी है।

source: Don't call me.
hi: मुझे काल मत करना.

source: How many people are there in Europe?
hi: युरोप में कितने लोग हैं?

source: Paper was invented in China.
hi: कागज़ का आविष्कार चीन में किया गया था।

source: I love her so much I could die.
hi: मैं उसके प्यार में मरने के लिए भी तयार हूँ.

source: He's a famous physicist not only in Japan, but throughout the world.
hi: वह न केवल जापान में बल्कि पूरे विश्व में प्रसिद्व भौतिक शास्त्री है।

source: I learn ten new words every day.
hi: मैं हर रोज़ दस नये शब्द सीखता हूँ।

source: Russia has woken up.
hi: रूस जाग गया है।

source: Listen!
hi: सुन!

source: It has been six years since I started to study English.
hi: मुझे अंग्रेजी की पढाई शुरू किये हुए छह महिने हुए हैं।

source: Just forget it.
hi: बस भूल जाओ।

source: Seriously?
hi: सच में?

source: I know you're upset about your car being totaled, but you weren't injured and you should be thankful to be alive.
hi: मुझे ज्ञात है तुम अपनी कार खराब होने के कारण परेशान हो, परन्तु तुम्हे कोई चोट नहीं लगी, तुम्हे तो जीवित होने के लिए धन्यवाद देना चाहिए.

source: Are your friends Portuguese or Brazilian?
hi: तुम्हारे दोस्त पुर्त्तगाली हैं या ब्राज़ीली?

source: You punch like a girl.
hi: तुम किसी लड़की की तरह मुक्का मारते हो।

source: Round boxes? Are you nuts?
hi: गोल बक्से? पागल हो गये हो क्या?

source: I am who I am.
hi: मैं हूँ जो हूँ।

source: I don't have time to sleep.
hi: मेरे पास सोने के लिये वक्त नहीं है।

source: A "shiitake" is a type of mushroom.
hi: "शिइताके" यह कुकुरमुत्ते का एक प्रकार है।

source: It's written in pencil, so you can erase it.
hi: पेन्सिल से लिखा है, तो तुम उसे मिटा सकते हो।

source: It's magic.
hi: जादू।

source: Disgusting!
hi: घिनौना!

source: He turned 16 years old.
hi: वह १६ साल का हो गया।

source: It will rain tomorrow.
hi: कल बारिश गिरेगी।

source: They speak many languages in Spain.
hi: स्पेन में कई भाषाएं बोली जाती हैं।

source: Stay!
hi: ठहरना!

source: Pull!
hi: खींचो!

source: Southward.
hi: दक्षिण की तरफ़।

source: Every ship needs a captain.
hi: हर जहाज़ को एक कप्तान की ज़रूरत होती है।

source: Faster!
hi: और तेज़!

source: Chicken!
hi: डरपोक!

source: It's me!
hi: मैं हूँ!

source: My dad used to drive a Beetle.
hi: मेरे पापा बीटल चलाया करते थे।

source: He was a good king.
hi: वह अच्छा राजा था।

source: Done.
hi: हो गया।

source: He went abroad to study English.
hi: वह अंग्रेज़ी सीखने विदेश चला गया।

source: The Muslims call Jesus "Issa".
hi: मुसलमान यीशु को "ईसा" कहते हैं।

source: His eyes are red.
hi: उसकी आँखें लाल हैं।

source: Nijmegen is the oldest city in the Netherlands.
hi: नैइमेग़न नीदरलैंड में सबसे पुराना शहर है।

source: He took out one egg.
hi: उसने एक अंडा बहर निकाला।

source: My grandmother can fly.
hi: मेरी दादी उड़ सकती है।

source: They say that golf is very popular in Japan.
hi: कहाँ जाता है कि जापान में गोल्फ़ बहुत लोकप्रिय है।

source: It seems that many people don't know the difference between "then" and "than".
hi: लगता है बहुत सारे लोगों को "देन" और "दॅन" के बीच का फ़र्क पता नहीं है।

source: I eat tofu.
hi: मैं टोफ़ू खाता हूँ।

source: It's five o'clock.
hi: पाच बज गए हैं।

source: We are lost.
hi: हम खो गये हैं ।

source: Where is Sevilla in Italy?
hi: इटली में सेविल्ला कहाँ है?

source: That new song is called "Lollipop".
hi: उस नये गाने का नाम "लॉलीपॉप" है।

source: Are wasps poisonous?
hi: क्या ततैयां ज़हरीली होती हैं?

source: Don't let anyone into the room.
hi: किसी को भी कमरे में आने मत देना।

source: French is spoken in France and in some parts of Italy.
hi: फ्रेंच फ्रांस में अौर इटली के कुछ हिस्सो में बोली जाती है।

source: Goal!
hi: गोल!

source: "Our customers are in Taiwan", explained Tom.
hi: "हमारे ग्राहक ताइवान में हैं," टॉम ने समझाया।

source: Mary's parents live in a big house.
hi: मैरी के माता-पिता बड़े घर में रहते हैं।

source: Mary's parents live in a large house.
hi: मैरी के माता-पिता बड़े घर में रहते हैं।

source: Okay.
hi: ठीक है।

source: Do you like to travel? Me too.
hi: "क्या तुम यात्रा करना पसंद करते हो?" "मैं भी।"

source: Don't say anything without thinking.
hi: बिना सोचे कुछ मत कहना।

source: Green is my favourite colour.
hi: हरा मेरा पसंदीदा रंग है।

source: My history teacher is an old Portuguese.
hi: मेरे इतिहास के शिक्षक एक वृद्ध पुर्त्तगाली हैं।

source: Mary slapped Tom.
hi: मैरी ने टॉम को थप्पड़ मारी।

source: Burj Khalifa is currently the tallest skyscraper in the world.
hi: अभी तक बुर्ज खलीफा दुनिया की सबसे लम्बी इमारत है।

source: I saw an airplane.
hi: मुझे एक हवाई जहाज़ दिखा।

source: My uncle has a house in Italy.
hi: मेरे चाचा का इटली में एक घर है।

source: Tom has a black cat.
hi: टॉम के पास एक काली बिल्ली है।

source: If possible, I'd like to know the name of the author.
hi: अगर हो सके तो में लेखक का नाम जानना चाहूंगी।

source: Dutch people can speak many languages.
hi: डच लोगों को कई भाषाएँ बोलनी आती हैं।

source: Russia is big.
hi: रूस बड़ा है।

source: Red is better.
hi: लाल बेहतर है।

source: Mary slapped me.
hi: मैरी ने मुझे थप्पड़ मारी।

source: Tom and Mary are very hungry.
hi: टॉम और मॅरी बहुत भूखें हैं।

source: The President proposed a new plan.
hi: राष्ट्रपति ने एक नयी योजना प्रस्थापित की।

source: I'm used to living alone.
hi: मुझे अकेले रहने की आदत है।

source: She came here once again.
hi: वह यहाँ और एक बार आई थी।

source: Turkey is a beautiful country.
hi: तुर्की एक सुंदर देश।

source: Esperanto will triumph.
hi: एस्पेरांतो जीतेगी।

source: What language is spoken in the USA?
hi: यू एस ए में कौन सी भाषा बोली जाती है?

source: Life is a mirror!
hi: ज़िंदगी एक आईना है!

source: I'm going to Spain next week.
hi: मैं अगले हफ़्ते स्पेन जा रहा हूँ।

source: Everyone in my family gets up early.
hi: मेरे परिवार में हर कोई जल्दी उठता है।

source: Poppycock.
hi: ऊलजलूल.

source: Bullshit.
hi: बकवास.

source: It looks like it'll rain.
hi: लगता है बारिश होगी।

source: What's the Italian pronunciation of this word?
hi: इस शब्द का इतालवी उच्चारण क्या है?

source: That's odd.
hi: अजीब बात है।

source: Your lips are red.
hi: तुम्हारे होंठ लाल हैं।

source: The house is small, but it's enough for us.
hi: घर तो छोटा है, किन्तु हमारे लिए पर्याप्त है।
